Documents/ПриемЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПриемЗаказов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗаказа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтоговаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставЗаказа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНаЕдиницу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПриемЗаказов/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Хозрасчетный.Записывать = Истина; 
	Движения.Хозрасчетный.Очистить();
	
	// 1. Счета
	Счет20 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("20");
	Счет10 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("10");
	Счет43 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("43");
	Счет71 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("71");
	
	// 2. Виды Субконто
	СубконтоТовары     = ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Товары");
	СубконтоМатериалы  = ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Материалы");
	СубконтоСклады     = ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Склады");
	СубконтоСотрудники = ПланыВидовХарактеристик.ВидыСубконто.НайтиПоНаименованию("Сотрудники");
	
	основнойСклад = Справочники.Склады.НайтиПоНаименованию("Основной склад");

	// --- ЛОГИКА ПРОВОДОК ---

	// СТАТУС: Ожидание сырья (Дт 20 - Кт 71)
	Если Статус = Перечисления.Статусы.ОжиданиеСырья Тогда
		Движение = Движения.Хозрасчетный.Добавить();
		Движение.Период = Дата;
		Движение.СчетДт = Счет20; 
		Движение.СчетКт = Счет71; 
		Движение.Сумма  = ИтоговаяСтоимость;
		
		Движение.СубконтоДт[СубконтоТовары]     = Товар;
		Движение.СубконтоКт[СубконтоСотрудники] = Ответственный;
		
		// Добавим количество в Дт, чтобы видеть план выпуска
		Движение.КоличествоДт = КоличествоЗаказа;

	// СТАТУС: В работе (Дт 20 - Кт 10)
	ИначеЕсли Статус = Перечисления.Статусы.ВРаботе Тогда
		Для Каждого ТекСтрока Из СоставЗаказа Цикл
			Движение = Движения.Хозрасчетный.Добавить();
			Движение.Период = Дата;
			Движение.СчетДт = Счет20;
			Движение.СчетКт = Счет10;
			Движение.Сумма = ТекСтрока.Сумма;
			
			// Списание материалов (Количество Кт)
			Движение.КоличествоКт = ТекСтрока.ВсегоКоличество;
			
			Движение.СубконтоДт[СубконтоТовары]     = Товар;
			Движение.СубконтоКт[СубконтоМатериалы]  = ТекСтрока.Материал;
			Движение.СубконтоКт[СубконтоСклады]     = основнойСклад;
		КонецЦикла;

	// СТАТУС: Отправлен на склад (Дт 43 - Кт 20)
	ИначеЕсли Статус = Перечисления.Статусы.ОтправленНаСклад Тогда
		Движение = Движения.Хозрасчетный.Добавить();
		Движение.Период = Дата;
		Движение.СчетДт = Счет43;
		Движение.СчетКт = Счет20;
		Движение.Сумма = ИтоговаяСтоимость;
		
		// Поступление готовой продукции (Количество Дт)
		Движение.КоличествоДт = КоличествоЗаказа;
		// Списание из производства (Количество Кт)
		Движение.КоличествоКт = КоличествоЗаказа;
		
		Движение.СубконтоДт[СубконтоТовары] = Товар;
		Движение.СубконтоДт[СубконтоСклады] = Склад; 
		Движение.СубконтоКт[СубконтоТовары] = Товар;
	КонецЕсли;

КонецПроцедуры
